#Напишите программу, 
# которая определит позицию второго вхождения строки
# в списке либо сообщит, что её нет.
# Пример:

#     список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
#     список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
#     список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
#     список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
#     список: [], ищем: "123", ответ: -1

ls = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
n = input(" Введите одно значение ")
def search1(x, y):
  number = 0
  for i in range(len(x)):
    if x[i]== y:
      number+=1
    if number==2:
      return (i) 
  else:
    return (-1)
    
print(search1(ls,n))


