# 43. Дана последовательность чисел.
# Получить список уникальных элементов заданной последовательности.

# *Пример:* 

# [1, 2, 3, 5, 1, 5, 3, 10] => [2, 10]

import random
lsrand =[random.randint(0,11) for i in range(1, 11)]
print(lsrand)
print(lsrand.count(1))



# def getLs()
# ls = random.randint(0,11)
# nums = [n for n in range(1,6)]
# odd_squares = [n*n for n in nums if n%2 == 1]



